alibaba/AliOS-Things/platform/mcu/msp432p4xx/ti/devices/msp432p4xx/rom/msp432p4111_driverlib.c
    /* Enabling the assigned interrupt */
    DMA_enableInterrupt(interruptNumber);
}


void DMA_enableInterrupt(uint32_t interruptNumber)
{
    ASSERT(
            (interruptNumber == DMA_INT0) || (interruptNumber == DMA_INT1)
            || (interruptNumber == DMA_INT2)
            || (interruptNumber == DMA_INT3));

    if (interruptNumber == DMA_INT1)
    {
        DMA_Channel->INT1_SRCCFG |= DMA_INT1_SRCCFG_EN;
    } else if (interruptNumber == DMA_INT2)
    {
        DMA_Channel->INT2_SRCCFG |= DMA_INT2_SRCCFG_EN;
    } else if (interruptNumber == DMA_INT3)
    {
        DMA_Channel->INT3_SRCCFG |= DMA_INT3_SRCCFG_EN;
    }

}


void DMA_disableInterrupt(uint32_t interruptNumber)
{
    ASSERT(
            (interruptNumber == DMA_INT0) || (interruptNumber == DMA_INT1)
            || (interruptNumber == DMA_INT2)
            || (interruptNumber == DMA_INT3));

    if (interruptNumber == DMA_INT1)
    {
        DMA_Channel->INT1_SRCCFG &= ~DMA_INT1_SRCCFG_EN;
    } else if (interruptNumber == DMA_INT2)
    {
        DMA_Channel->INT2_SRCCFG &= ~DMA_INT2_SRCCFG_EN;
    } else if (interruptNumber == DMA_INT3)
    {
        DMA_Channel->INT3_SRCCFG &= ~DMA_INT3_SRCCFG_EN;
    }
}


uint32_t DMA_getInterruptStatus(void)
{
    return DMA_Channel->INT0_SRCFLG;
}


void DMA_clearInterruptFlag(uint32_t channel)
{
    DMA_Channel->INT0_CLRFLG |= (1 << channel);
}


static const uint32_t __getBurstProgramRegs[16] =
{ (uint32_t)&FLCTL_A->PRGBRST_DATA0_0, (uint32_t)&FLCTL_A->PRGBRST_DATA0_1,
       (uint32_t) &FLCTL_A->PRGBRST_DATA0_2, (uint32_t)&FLCTL_A->PRGBRST_DATA0_3,
        (uint32_t)&FLCTL_A->PRGBRST_DATA1_0,(uint32_t) &FLCTL_A->PRGBRST_DATA1_1,
        (uint32_t)&FLCTL_A->PRGBRST_DATA1_2, (uint32_t)&FLCTL_A->PRGBRST_DATA1_3,
       (uint32_t) &FLCTL_A->PRGBRST_DATA2_0, (uint32_t)&FLCTL_A->PRGBRST_DATA2_1,
        (uint32_t)&FLCTL_A->PRGBRST_DATA2_2,(uint32_t) &FLCTL_A->PRGBRST_DATA2_3,
       (uint32_t) &FLCTL_A->PRGBRST_DATA3_0,(uint32_t) &FLCTL_A->PRGBRST_DATA3_1,
       (uint32_t) &FLCTL_A->PRGBRST_DATA3_2,(uint32_t) &FLCTL_A->PRGBRST_DATA3_3 };


static void __saveProtectionRegisters(__FlashCtl_ProtectionRegister *pReg)
{
    pReg->B0_INFO_R0 = FLCTL_A->BANK0_INFO_WEPROT;
    pReg->B1_INFO_R0 = FLCTL_A->BANK1_INFO_WEPROT;
    pReg->B0_MAIN_R0 = FLCTL_A->BANK0_MAIN_WEPROT0;
    pReg->B0_MAIN_R1 = FLCTL_A->BANK0_MAIN_WEPROT1;
    pReg->B0_MAIN_R2 = FLCTL_A->BANK0_MAIN_WEPROT2;
    pReg->B0_MAIN_R3 = FLCTL_A->BANK0_MAIN_WEPROT3;
    pReg->B0_MAIN_R4 = FLCTL_A->BANK0_MAIN_WEPROT4;
    pReg->B0_MAIN_R5 = FLCTL_A->BANK0_MAIN_WEPROT5;
    pReg->B0_MAIN_R6 = FLCTL_A->BANK0_MAIN_WEPROT6;
    pReg->B0_MAIN_R7 = FLCTL_A->BANK0_MAIN_WEPROT7;
    pReg->B1_MAIN_R0 = FLCTL_A->BANK1_MAIN_WEPROT0;
    pReg->B1_MAIN_R1 = FLCTL_A->BANK1_MAIN_WEPROT1;
    pReg->B1_MAIN_R2 = FLCTL_A->BANK1_MAIN_WEPROT2;
    pReg->B1_MAIN_R3 = FLCTL_A->BANK1_MAIN_WEPROT3;
    pReg->B1_MAIN_R4 = FLCTL_A->BANK1_MAIN_WEPROT4;
    pReg->B1_MAIN_R5 = FLCTL_A->BANK1_MAIN_WEPROT5;
    pReg->B1_MAIN_R6 = FLCTL_A->BANK1_MAIN_WEPROT6;
    pReg->B1_MAIN_R7 = FLCTL_A->BANK1_MAIN_WEPROT7;
}


static void __restoreProtectionRegisters(__FlashCtl_ProtectionRegister *pReg)
{
    FLCTL_A->BANK0_INFO_WEPROT = pReg->B0_INFO_R0;
    FLCTL_A->BANK1_INFO_WEPROT = pReg->B1_INFO_R0;
    FLCTL_A->BANK0_MAIN_WEPROT0 = pReg->B0_MAIN_R0;
    FLCTL_A->BANK0_MAIN_WEPROT1 = pReg->B0_MAIN_R1;
    FLCTL_A->BANK0_MAIN_WEPROT2 = pReg->B0_MAIN_R2;
    FLCTL_A->BANK0_MAIN_WEPROT3 = pReg->B0_MAIN_R3;
    FLCTL_A->BANK0_MAIN_WEPROT4 = pReg->B0_MAIN_R4;
    FLCTL_A->BANK0_MAIN_WEPROT5 = pReg->B0_MAIN_R5;
    FLCTL_A->BANK0_MAIN_WEPROT6 = pReg->B0_MAIN_R6;
    FLCTL_A->BANK0_MAIN_WEPROT7 = pReg->B0_MAIN_R7;
    FLCTL_A->BANK1_MAIN_WEPROT0 = pReg->B1_MAIN_R0;
    FLCTL_A->BANK1_MAIN_WEPROT1 = pReg->B1_MAIN_R1;
    FLCTL_A->BANK1_MAIN_WEPROT2 = pReg->B1_MAIN_R2;
    FLCTL_A->BANK1_MAIN_WEPROT3 = pReg->B1_MAIN_R3;
    FLCTL_A->BANK1_MAIN_WEPROT4 = pReg->B1_MAIN_R4;
    FLCTL_A->BANK1_MAIN_WEPROT5 = pReg->B1_MAIN_R5;
    FLCTL_A->BANK1_MAIN_WEPROT6 = pReg->B1_MAIN_R6;
    FLCTL_A->BANK1_MAIN_WEPROT7 = pReg->B1_MAIN_R7;
}


uint8_t __FlashCtl_A_remaskData8Post(uint8_t data, uint32_t addr)
{
    uint32_t readMode, waitState, bankProgram, bankOneStart;

    /* Changing the waitstate and read mode of whichever bank we are in */
    /* Finding out which bank we are in */
    if (addr >= SysCtl_A_getFlashSize())
    {
        bankOneStart = __INFO_FLASH_A_TECH_MIDDLE__;
    } else
    {
        bankOneStart = SysCtl_A_getFlashSize() / 2;
    }

    bankProgram = addr < (bankOneStart) ? FLASH_A_BANK0 : FLASH_A_BANK1;

    /* Saving the current wait states and read mode */
    waitState = FlashCtl_A_getWaitState(bankProgram);
    readMode = FlashCtl_A_getReadMode(bankProgram);

    /* Setting the wait state to account for the mode */
    FlashCtl_A_setWaitState(bankProgram, (2 * waitState) + 1);

    /* Changing to PROGRAM VERIFY mode */
    FlashCtl_A_setReadMode(bankProgram, FLASH_A_PROGRAM_VERIFY_READ_MODE);

    data = ~(~(data) & HWREG8(addr));

    /* Setting the wait state to account for the mode */
    FlashCtl_A_setReadMode(bankProgram, readMode);
    FlashCtl_A_setWaitState(bankProgram, waitState);

    return data;
}


uint8_t __FlashCtl_A_remaskData8Pre(uint8_t data, uint32_t addr)
{
    uint32_t readMode, waitState, bankProgram, bankOneStart;

    /* Changing the waitstate and read mode of whichever bank we are in */
    /* Finding out which bank we are in */
    if (addr >= SysCtl_A_getFlashSize())
    {
        bankOneStart = __INFO_FLASH_A_TECH_MIDDLE__;
    } else
    {
        bankOneStart = SysCtl_A_getFlashSize() / 2;
    }

    bankProgram = addr < (bankOneStart) ? FLASH_A_BANK0 : FLASH_A_BANK1;

    /* Saving the current wait states and read mode */
    waitState = FlashCtl_A_getWaitState(bankProgram);
    readMode = FlashCtl_A_getReadMode(bankProgram);

    /* Setting the wait state to account for the mode */
    FlashCtl_A_setWaitState(bankProgram, (2 * waitState) + 1);

    /* Changing to PROGRAM VERIFY mode */
    FlashCtl_A_setReadMode(bankProgram, FLASH_A_PROGRAM_VERIFY_READ_MODE);

    data |= ~(HWREG8(addr) | data);

    /* Setting the wait state to account for the mode */
    FlashCtl_A_setReadMode(bankProgram, readMode);
    FlashCtl_A_setWaitState(bankProgram, waitState);

