alibaba/AliOS-Things/platform/mcu/msp432p4xx/ti/devices/msp432p4xx/rom/msp432p4111_driverlib.c
    bankProgramStart = addr < bank1Start ? FLASH_A_BANK0 : FLASH_A_BANK1;
    bankProgramEnd = (addr + size) < bank1Start ? FLASH_A_BANK0 : FLASH_A_BANK1;

    /* Saving the current wait states and read mode */
    b0WaitState = FlashCtl_A_getWaitState(bankProgramStart);
    b0ReadMode = FlashCtl_A_getReadMode(bankProgramStart);
    FlashCtl_A_setWaitState(bankProgramStart, (2 * b0WaitState) + 1);
    FlashCtl_A_setReadMode(bankProgramStart, FLASH_A_PROGRAM_VERIFY_READ_MODE);

    if (bankProgramStart != bankProgramEnd)
    {
        b1WaitState = FlashCtl_A_getWaitState(bankProgramEnd);
        b1ReadMode = FlashCtl_A_getReadMode(bankProgramEnd);
        FlashCtl_A_setWaitState(bankProgramEnd, (2 * b1WaitState) + 1);
        FlashCtl_A_setReadMode(bankProgramEnd,
        FLASH_A_PROGRAM_VERIFY_READ_MODE);
    }

    /* Going through each BURST program register and masking out for pre
     * verifcation
     */
    size = (size / 4);
    for (ii = 0; ii < size; ii++)
    {
        HWREG32(__getBurstProgramRegs[ii]) |=
                ~(HWREG32(__getBurstProgramRegs[ii]) | HWREG32(addr));
        addr += 4;
    }

    /* Setting the wait state to account for the mode */
    FlashCtl_A_setReadMode(bankProgramStart, b0ReadMode);
    FlashCtl_A_setWaitState(bankProgramStart, b0WaitState);

    if (bankProgramStart != bankProgramEnd)
    {
        FlashCtl_A_setReadMode(bankProgramEnd, b1ReadMode);
        FlashCtl_A_setWaitState(bankProgramEnd, b1WaitState);
    }

}


static bool _FlashCtl_A_Program8(uint32_t src, uint32_t dest, uint32_t mTries)
{
    uint32_t ii;
    uint8_t data;

    /* Enabling the correct verification settings  */
    FlashCtl_A_setProgramVerification(FLASH_A_REGPRE | FLASH_A_REGPOST);
    FlashCtl_A_clearProgramVerification(FLASH_A_BURSTPOST | FLASH_A_BURSTPRE);

    data = HWREG8(src);

    for (ii = 0; ii < mTries; ii++)
    {
        /* Clearing flags */
        FLCTL_A->CLRIFG |= (FLASH_A_PROGRAM_ERROR | FLASH_A_POSTVERIFY_FAILED
                | FLASH_A_PREVERIFY_FAILED | FLASH_A_WRDPRGM_COMPLETE);

        HWREG8(dest) = data;

        while (!(FlashCtl_A_getInterruptStatus() & FLASH_A_WRDPRGM_COMPLETE))
        {
            __no_operation();
        }

        /* Pre-Verify */
        if ((BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_VER_PRE_OFS)
                && BITBAND_PERI(FLCTL_A->IFG, FLCTL_A_IFG_AVPRE_OFS)))
        {
            data = __FlashCtl_A_remaskData8Pre(data, dest);

            if (data != 0xFF)
            {
                FlashCtl_A_clearProgramVerification(FLASH_A_REGPRE);
                continue;
            }

        }

        /* Post Verify */
        if ((BITBAND_PERI(FLCTL_A->IFG, FLCTL_A_IFG_AVPST_OFS)))
        {
            data = __FlashCtl_A_remaskData8Post(data, dest);

            /* Seeing if we actually need to do another pulse */
            if (data == 0xFF)
                return true;

            FlashCtl_A_setProgramVerification(FLASH_A_REGPRE | FLASH_A_REGPOST);
            continue;
        }

        /* If we got this far, return true */
        return true;

    }

    return false;

}


static bool _FlashCtl_A_Program32(uint32_t src, uint32_t dest, uint32_t mTries)
{
    uint32_t ii;
    uint32_t data;

    /* Enabling the correct verification settings  */
    FlashCtl_A_setProgramVerification(FLASH_A_REGPRE | FLASH_A_REGPOST);
    FlashCtl_A_clearProgramVerification(FLASH_A_BURSTPOST | FLASH_A_BURSTPRE);

    data = HWREG32(src);

    for (ii = 0; ii < mTries; ii++)
    {
        /* Clearing flags */
        FLCTL_A->CLRIFG |= (FLASH_A_PROGRAM_ERROR | FLASH_A_POSTVERIFY_FAILED
                | FLASH_A_PREVERIFY_FAILED | FLASH_A_WRDPRGM_COMPLETE);

        HWREG32(dest) = data;

        while (!(FlashCtl_A_getInterruptStatus() & FLASH_A_WRDPRGM_COMPLETE))
        {
            __no_operation();
        }

        /* Pre-Verify */
        if ((BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_VER_PRE_OFS)
                && BITBAND_PERI(FLCTL_A->IFG, FLCTL_A_IFG_AVPRE_OFS)))
        {
            data = __FlashCtl_A_remaskData32Pre(data, dest);

            if (data != 0xFFFFFFFF)
            {

                FlashCtl_A_clearProgramVerification(FLASH_A_REGPRE);
                continue;
            }

        }

        /* Post Verify */
        if ((BITBAND_PERI(FLCTL_A->IFG, FLCTL_A_IFG_AVPST_OFS)))
        {
            data = __FlashCtl_A_remaskData32Post(data, dest);

            /* Seeing if we actually need to do another pulse */
            if (data == 0xFFFFFFFF)
                return true;

            FlashCtl_A_setProgramVerification(FLASH_A_REGPRE | FLASH_A_REGPOST);
            continue;
        }

        /* If we got this far, return true */
        return true;

    }

    return false;

}


static bool _FlashCtl_A_ProgramBurst(uint32_t src, uint32_t dest,
        uint32_t length, uint32_t mTries)
{
    uint32_t bCalc, otpOffset, ii, jj;
    bool res;

    /* Setting verification */
    FlashCtl_A_clearProgramVerification(FLASH_A_REGPRE | FLASH_A_REGPOST);
    FlashCtl_A_setProgramVerification(FLASH_A_BURSTPOST | FLASH_A_BURSTPRE);

    /* Assume Failure */
    res = false;

    /* Waiting for idle status */
    while ((FLCTL_A->PRGBRST_CTLSTAT & FLCTL_A_PRGBRST_CTLSTAT_BURST_STATUS_MASK)
            != FLCTL_A_PRGBRST_CTLSTAT_BURST_STATUS_0)
    {
        BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                FLCTL_A_PRGBRST_CTLSTAT_CLR_STAT_OFS) = 1;
    }

    /* Setting/clearing INFO flash flags as appropriate */
    if (dest >= SysCtl_A_getFlashSize())
    {
        FLCTL_A->PRGBRST_CTLSTAT = (FLCTL_A->PRGBRST_CTLSTAT
                & ~FLCTL_A_PRGBRST_CTLSTAT_TYPE_MASK)
                | FLCTL_A_PRGBRST_CTLSTAT_TYPE_1;
        otpOffset = __INFO_FLASH_A_TECH_START__;
    } else
    {
        FLCTL_A->PRGBRST_CTLSTAT = (FLCTL_A->PRGBRST_CTLSTAT
                & ~FLCTL_A_PRGBRST_CTLSTAT_TYPE_MASK)
                | FLCTL_A_PRGBRST_CTLSTAT_TYPE_0;
        otpOffset = 0;
    }

    bCalc = 0;
    FLCTL_A->PRGBRST_STARTADDR = (dest - otpOffset);

    /* Initially populating the burst registers */
    while (bCalc < 16 && length != 0)
    {
        HWREG32(__getBurstProgramRegs[bCalc]) = HWREG32(src);
        bCalc++;
        length -= 4;
        src += 4;
    }

    for (ii = 0; ii < mTries; ii++)
    {
        /* Clearing Flags */
        FLCTL_A->CLRIFG |= (FLASH_A_BRSTPRGM_COMPLETE
                | FLASH_A_POSTVERIFY_FAILED | FLASH_A_PREVERIFY_FAILED);

        /* Waiting for idle status */
        while ((FLCTL_A->PRGBRST_CTLSTAT
                & FLCTL_A_PRGBRST_CTLSTAT_BURST_STATUS_MASK)
                != FLCTL_A_PRGBRST_CTLSTAT_BURST_STATUS_0)
        {
            BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                    FLCTL_A_PRGBRST_CTLSTAT_CLR_STAT_OFS) = 1;
        }

        /* Start the burst program */
        FLCTL_A->PRGBRST_CTLSTAT = (FLCTL_A->PRGBRST_CTLSTAT
                & ~(FLCTL_A_PRGBRST_CTLSTAT_LEN_MASK))
                | ((bCalc / 4) << FLASH_A_BURST_PRG_BIT)
                | FLCTL_A_PRGBRST_CTLSTAT_START;

        /* Waiting for the burst to complete */
        while ((FLCTL_A->PRGBRST_CTLSTAT
                & FLCTL_A_PRGBRST_CTLSTAT_BURST_STATUS_MASK)
                != FLASH_A_PRGBRSTCTLSTAT_BURSTSTATUS_COMPLETE)
        {
            __no_operation();
        }

