alibaba/AliOS-Things/platform/mcu/msp432p4xx/ti/devices/msp432p4xx/rom/msp432p4111_driverlib.c
        /* Checking for errors and clearing/masking */

        /* Address Error */
        if (BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                FLCTL_A_PRGBRST_CTLSTAT_ADDR_ERR_OFS))
        {
            goto BurstCleanUp;
        }

        /* Pre-Verify Error */
        if (BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                FLCTL_A_PRGBRST_CTLSTAT_AUTO_PRE_OFS)
                && BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                        FLCTL_A_PRGBRST_CTLSTAT_PRE_ERR_OFS))
        {
            __FlashCtl_A_remaskBurstDataPre(dest, bCalc * 4);

            for (jj = 0; jj < bCalc; jj++)
            {
                if (HWREG32(__getBurstProgramRegs[jj]) != 0xFFFFFFFF)
                {
                    FlashCtl_A_clearProgramVerification(FLASH_A_BURSTPRE);
                    break;
                }
            }

            if (jj != bCalc)
                continue;
        }

        /* Post-Verify Error */
        if (BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                FLCTL_A_PRGBRST_CTLSTAT_PST_ERR_OFS))
        {
            __FlashCtl_A_remaskBurstDataPost(dest, bCalc * 4);

            for (jj = 0; jj < bCalc; jj++)
            {
                if ((HWREG32(__getBurstProgramRegs[jj])) != 0xFFFFFFFF)
                {
                    FlashCtl_A_setProgramVerification(
                    FLASH_A_BURSTPOST | FLASH_A_BURSTPRE);
                    break;
                }
            }

            if (jj != bCalc)
                continue;

        }

        /* If we got this far, the program happened */
        res = true;
        goto BurstCleanUp;
    }

    BurstCleanUp:
    /* Waiting for idle status */
    while ((FLCTL_A->PRGBRST_CTLSTAT & FLCTL_A_PRGBRST_CTLSTAT_BURST_STATUS_MASK)
            != FLCTL_A_PRGBRST_CTLSTAT_BURST_STATUS_0)
    {
        BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                FLCTL_A_PRGBRST_CTLSTAT_CLR_STAT_OFS) = 1;
    }
    return res;
}


void FlashCtl_A_enableReadBuffering(uint_fast8_t memoryBank,
        uint_fast8_t accessMethod)
{
    if (memoryBank == FLASH_A_BANK0 && accessMethod == FLASH_A_DATA_READ)
        BITBAND_PERI(FLCTL_A->BANK0_RDCTL, FLCTL_A_BANK0_RDCTL_BUFD_OFS) = 1;
    else if (memoryBank == FLASH_A_BANK1 && accessMethod == FLASH_A_DATA_READ)
        BITBAND_PERI(FLCTL_A->BANK1_RDCTL, FLCTL_A_BANK1_RDCTL_BUFD_OFS) = 1;
    else if (memoryBank == FLASH_A_BANK0
            && accessMethod == FLASH_A_INSTRUCTION_FETCH)
        BITBAND_PERI(FLCTL_A->BANK0_RDCTL, FLCTL_A_BANK0_RDCTL_BUFI_OFS) = 1;
    else if (memoryBank == FLASH_A_BANK1
            && accessMethod == FLASH_A_INSTRUCTION_FETCH)
        BITBAND_PERI(FLCTL_A->BANK1_RDCTL, FLCTL_A_BANK1_RDCTL_BUFI_OFS) = 1;
    else
        ASSERT(false);
}


void FlashCtl_A_disableReadBuffering(uint_fast8_t memoryBank,
        uint_fast8_t accessMethod)
{
    if (memoryBank == FLASH_A_BANK0 && accessMethod == FLASH_A_DATA_READ)
        BITBAND_PERI(FLCTL_A->BANK0_RDCTL, FLCTL_A_BANK0_RDCTL_BUFD_OFS) = 0;
    else if (memoryBank == FLASH_A_BANK1 && accessMethod == FLASH_A_DATA_READ)
        BITBAND_PERI(FLCTL_A->BANK1_RDCTL, FLCTL_A_BANK1_RDCTL_BUFD_OFS) = 0;
    else if (memoryBank == FLASH_A_BANK0
            && accessMethod == FLASH_A_INSTRUCTION_FETCH)
        BITBAND_PERI(FLCTL_A->BANK0_RDCTL, FLCTL_A_BANK0_RDCTL_BUFI_OFS) = 0;
    else if (memoryBank == FLASH_A_BANK1
            && accessMethod == FLASH_A_INSTRUCTION_FETCH)
        BITBAND_PERI(FLCTL_A->BANK1_RDCTL, FLCTL_A_BANK1_RDCTL_BUFI_OFS) = 0;
    else
        ASSERT(false);
}


bool FlashCtl_A_unprotectMemory(uint32_t startAddr, uint32_t endAddr)
{
    uint32_t startBankBit, endBankBit, cutOffMemory;
    volatile uint32_t* baseStartConfig, *baseEndConfig;

    if (startAddr > endAddr)
        return false;

    if (endAddr >= SysCtl_A_getFlashSize())
    {
        cutOffMemory = (SysCtl_A_getInfoFlashSize() >> 1)
                + __INFO_FLASH_A_TECH_START__;

        if (endAddr < cutOffMemory && startAddr < cutOffMemory)
        {
            startBankBit = (startAddr - __INFO_FLASH_A_TECH_START__)
                    / FLASH_A_SECTOR_SIZE;
            endBankBit = (endAddr - __INFO_FLASH_A_TECH_START__)
                    / FLASH_A_SECTOR_SIZE;
            FLCTL_A->BANK0_INFO_WEPROT &= ~(0xFFFFFFFF >> (31 - endBankBit))
                    & (0xFFFFFFFF << startBankBit);
        } else if (endAddr > cutOffMemory && startAddr > cutOffMemory)
        {
            startBankBit = (startAddr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            endBankBit = (endAddr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            FLCTL_A->BANK1_INFO_WEPROT &= ~((0xFFFFFFFF >> (31 - endBankBit))
                    & (0xFFFFFFFF << startBankBit));
        } else
        {
            startBankBit = (startAddr - __INFO_FLASH_A_TECH_START__)
                    / FLASH_A_SECTOR_SIZE;
            endBankBit = (endAddr - cutOffMemory)/FLASH_A_SECTOR_SIZE;
            FLCTL_A->BANK0_INFO_WEPROT &= ~(0xFFFFFFFF << startBankBit) & 0xF;
            FLCTL_A->BANK1_INFO_WEPROT &= ~(0xFFFFFFFF >> (31 - (endBankBit))) & 0xF;
        }

        return true;

    } else
    {
        cutOffMemory = SysCtl_A_getFlashSize() >> 1;

        if (endAddr < cutOffMemory)
        {
            endBankBit = endAddr / FLASH_A_SECTOR_SIZE;
            baseEndConfig = &FLCTL_A->BANK0_MAIN_WEPROT0
                    + ((endBankBit >> 5));
            endBankBit &= 0x1F;
        } else
        {
            endBankBit = (endAddr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            baseEndConfig = &FLCTL_A->BANK1_MAIN_WEPROT0
                    + (endBankBit >> 5);
            endBankBit &= 0x1F;
        }

        if (startAddr < cutOffMemory)
        {
            startBankBit = (startAddr / FLASH_A_SECTOR_SIZE);
            baseStartConfig = &FLCTL_A->BANK0_MAIN_WEPROT0
                    + (startBankBit >> 5);
            startBankBit &= 0x1F;
        } else
        {
            startBankBit = (startAddr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            baseStartConfig = &FLCTL_A->BANK1_MAIN_WEPROT0
                    + (startBankBit >> 5);
            startBankBit &= 0x1F;
        }

        if (baseStartConfig == baseEndConfig)
        {
            (*baseStartConfig) &= ~((0xFFFFFFFF >> (31 - endBankBit))
                    & (0xFFFFFFFF << startBankBit));
            return true;
        }

        *baseStartConfig &= ~(0xFFFFFFFF << startBankBit);

        if (baseStartConfig == &FLCTL_A->BANK0_MAIN_WEPROT7)
        {
            baseStartConfig = &FLCTL_A->BANK1_MAIN_WEPROT0;
        } else
        {
            baseStartConfig++;
        }

        while (baseStartConfig != baseEndConfig)
        {
            *baseStartConfig = 0;

            if (baseStartConfig == &FLCTL_A->BANK0_MAIN_WEPROT7)
            {
                baseStartConfig = &FLCTL_A->BANK1_MAIN_WEPROT0;
            } else
            {
                baseStartConfig++;
            }
        }

        (*baseEndConfig) &= ~(0xFFFFFFFF >> (31 - (endBankBit)));
    }

