alibaba/AliOS-Things/platform/mcu/msp432p4xx/ti/devices/msp432p4xx/rom/msp432p4111_driverlib.c
    return true;

}


bool FlashCtl_A_protectMemory(uint32_t startAddr, uint32_t endAddr)
{
    uint32_t startBankBit, endBankBit, cutOffMemory;
    volatile uint32_t* baseStartConfig, *baseEndConfig;

    if (startAddr > endAddr)
        return false;

    if (endAddr >= SysCtl_A_getFlashSize())
    {
        cutOffMemory = (SysCtl_A_getInfoFlashSize() >> 1)
                        + __INFO_FLASH_A_TECH_START__;

        if (endAddr < cutOffMemory && startAddr < cutOffMemory)
        {
            startBankBit = (startAddr - __INFO_FLASH_A_TECH_START__)
                    / FLASH_A_SECTOR_SIZE;
            endBankBit = (endAddr - __INFO_FLASH_A_TECH_START__)
                    / FLASH_A_SECTOR_SIZE;
            FLCTL_A->BANK0_INFO_WEPROT |= (0xFFFFFFFF >> (31 - endBankBit))
                    & (0xFFFFFFFF << startBankBit);
        } else if (endAddr > cutOffMemory && startAddr > cutOffMemory)
        {
            startBankBit = (startAddr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            endBankBit = (endAddr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            FLCTL_A->BANK1_INFO_WEPROT |= (0xFFFFFFFF >> (31 - endBankBit))
                    & (0xFFFFFFFF << startBankBit);
        } else
        {
            startBankBit = (startAddr - __INFO_FLASH_A_TECH_START__)
                    / FLASH_A_SECTOR_SIZE;
            endBankBit = (endAddr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            FLCTL_A->BANK0_INFO_WEPROT |= (0xFFFFFFFF << startBankBit);
            FLCTL_A->BANK1_INFO_WEPROT |= (0xFFFFFFFF >> (31 - (endBankBit)));
        }

        return true;

    } else
    {
        cutOffMemory = SysCtl_A_getFlashSize() >> 1;

        if (endAddr < cutOffMemory)
        {
            endBankBit = endAddr / FLASH_A_SECTOR_SIZE;
            baseEndConfig = &FLCTL_A->BANK0_MAIN_WEPROT0
                    + ((endBankBit >> 5));
            endBankBit &= 0x1F;
        } else
        {
            endBankBit = (endAddr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            baseEndConfig = &FLCTL_A->BANK1_MAIN_WEPROT0
                    + (endBankBit >> 5);
            endBankBit &= 0x1F;
        }

        if (startAddr < cutOffMemory)
        {
            startBankBit = (startAddr / FLASH_A_SECTOR_SIZE);
            baseStartConfig = &FLCTL_A->BANK0_MAIN_WEPROT0
                    + (startBankBit >> 5);
            startBankBit &= 0x1F;
        } else
        {
            startBankBit = (startAddr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            baseStartConfig = &FLCTL_A->BANK1_MAIN_WEPROT0
                    + (startBankBit >> 5);
            startBankBit &= 0x1F;
        }

        if (baseStartConfig == baseEndConfig)
        {
            (*baseStartConfig) |= (0xFFFFFFFF >> (31 - endBankBit))
                    & (0xFFFFFFFF << startBankBit);
            return true;
        }

        *baseStartConfig |= (0xFFFFFFFF << startBankBit);

        if (baseStartConfig == &FLCTL_A->BANK0_MAIN_WEPROT7)
        {
            baseStartConfig = &FLCTL_A->BANK1_MAIN_WEPROT0;
        } else
        {
            baseStartConfig++;
        }

        while (baseStartConfig != baseEndConfig)
        {
            *baseStartConfig = 0xFFFFFFFF;

            if (baseStartConfig == &FLCTL_A->BANK0_MAIN_WEPROT7)
            {
                baseStartConfig = &FLCTL_A->BANK1_MAIN_WEPROT0;
            } else
            {
                baseStartConfig++;
            }
        }

        (*baseEndConfig) |= (0xFFFFFFFF >> (31 - (endBankBit)));
    }

    return true;

}


bool FlashCtl_A_isMemoryRangeProtected(uint32_t startAddr, uint32_t endAddr)
{
    uint32_t ii;

    if (startAddr > endAddr)
        return false;

    startAddr = (startAddr & 0xFFFFF000);
    endAddr = (endAddr & 0xFFFFF000);

    for (ii = startAddr; ii <= endAddr; ii+=FLASH_A_SECTOR_SIZE)
    {
        if (!FlashCtl_A_isMemoryProtected(ii))
            return false;
    }
    return true;
}


bool FlashCtl_A_isMemoryProtected(uint32_t addr)
{
    volatile uint32_t *configRegister;
    uint32_t memoryBit, cutOffMemory;

    if (addr >= SysCtl_A_getFlashSize())
    {
        cutOffMemory = (SysCtl_A_getInfoFlashSize() >> 1) + __INFO_FLASH_A_TECH_START__;

        if (addr < cutOffMemory)
        {
            memoryBit = (addr - __INFO_FLASH_A_TECH_START__)
                    / FLASH_A_SECTOR_SIZE;
            configRegister = &FLCTL_A->BANK0_INFO_WEPROT
                    + ((memoryBit >> 5));
            memoryBit &= 0x1F;
        } else
        {
            memoryBit = (addr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            configRegister = &FLCTL_A->BANK1_INFO_WEPROT
                    + ((memoryBit >> 5));
            memoryBit &= 0x1F;
        }
    } else
    {
        cutOffMemory = SysCtl_A_getFlashSize() >> 1;

        if (addr < cutOffMemory)
        {
            memoryBit = addr / FLASH_A_SECTOR_SIZE;
            configRegister = &FLCTL_A->BANK0_MAIN_WEPROT0
                    + ((memoryBit >> 5));
            memoryBit &= 0x1F;
        } else
        {
            memoryBit = (addr - cutOffMemory) / FLASH_A_SECTOR_SIZE;
            configRegister = &FLCTL_A->BANK1_MAIN_WEPROT0
                    + ((memoryBit >> 5));
            memoryBit &= 0x1F;
        }
    }

    return (*configRegister & (1 << memoryBit));
}


bool FlashCtl_A_verifyMemory(void* verifyAddr, uint32_t length,
        uint_fast8_t pattern)
{
    uint32_t memoryPattern, addr, otpOffset;
    uint32_t b0WaitState, b1WaitState, intStatus;
    uint32_t bankOneStart, startBank, endBank;
    uint_fast8_t b0readMode, b1readMode;
    uint_fast8_t memoryType;
    bool res;

    ASSERT(pattern == FLASH_A_0_PATTERN || pattern == FLASH_A_1_PATTERN);

    /* Saving interrupt context and disabling interrupts for program
     * operation
     */
    intStatus = CPU_primask();
    Interrupt_disableMaster();

    /* Casting and determining the memory that we need to use */
    addr = (uint32_t) verifyAddr;
    memoryType = (addr >= SysCtl_A_getFlashSize()) ?
    FLASH_A_INFO_SPACE :
                                                FLASH_A_MAIN_SPACE;

    /* Assuming Failure */
    res = false;

    /* Finding out which bank we are in */
    if (addr >= SysCtl_A_getFlashSize())
    {
        bankOneStart = __INFO_FLASH_A_TECH_MIDDLE__;
    } else
    {
        bankOneStart = SysCtl_A_getFlashSize() / 2;
    }
    startBank = addr < (bankOneStart) ? FLASH_A_BANK0 : FLASH_A_BANK1;
    endBank = (addr + length) < (bankOneStart) ? FLASH_A_BANK0 : FLASH_A_BANK1;

    /* Saving context and changing read modes */
    b0WaitState = FlashCtl_A_getWaitState(startBank);
    b0readMode = FlashCtl_A_getReadMode(startBank);

    /* Setting the wait state to account for the mode */
    FlashCtl_A_setWaitState(startBank, (2 * b0WaitState) + 1);

    if (startBank != endBank)
    {
        b1WaitState = FlashCtl_A_getWaitState(endBank);
        b1readMode = FlashCtl_A_getReadMode(endBank);
        FlashCtl_A_setWaitState(endBank, (2 * b1WaitState) + 1);
    }

