alibaba/AliOS-Things/platform/mcu/msp432p4xx/ti/devices/msp432p4xx/rom/msp432p4111_driverlib.c
    /* Changing to the relevant VERIFY mode */
    if (pattern == FLASH_A_1_PATTERN)
    {
        FlashCtl_A_setReadMode(startBank, FLASH_A_ERASE_VERIFY_READ_MODE);

        if (startBank != endBank)
        {
            FlashCtl_A_setReadMode(endBank, FLASH_A_ERASE_VERIFY_READ_MODE);
        }

        memoryPattern = 0xFFFFFFFF;
    } else
    {
        FlashCtl_A_setReadMode(startBank, FLASH_A_PROGRAM_VERIFY_READ_MODE);

        if (startBank != endBank)
        {
            FlashCtl_A_setReadMode(endBank, FLASH_A_PROGRAM_VERIFY_READ_MODE);
        }

        memoryPattern = 0;
    }

    /* Taking care of byte accesses */
    while ((addr & 0x03) && (length > 0))
    {
        if (HWREG8(addr++) != ((uint8_t) memoryPattern))
            goto FlashVerifyCleanup;
        length--;
    }

    /* Making sure we are aligned by 128-bit address */
    while (((addr & 0x0F)) && (length > 3))
    {
        if (HWREG32(addr) != memoryPattern)
            goto FlashVerifyCleanup;

        addr = addr + 4;
        length = length - 4;
    }

    /* Burst Verify */
    if (length > 63)
    {
        /* Setting/clearing INFO flash flags as appropriate */
        if (addr >= SysCtl_A_getFlashSize())
        {
            FLCTL_A->RDBRST_CTLSTAT = (FLCTL_A->RDBRST_CTLSTAT
                    & ~FLCTL_A_RDBRST_CTLSTAT_MEM_TYPE_MASK)
                    | FLCTL_A_RDBRST_CTLSTAT_MEM_TYPE_1;
            otpOffset = __INFO_FLASH_A_TECH_START__;
        } else
        {
            FLCTL_A->RDBRST_CTLSTAT = (FLCTL_A->RDBRST_CTLSTAT
                    & ~FLCTL_A_RDBRST_CTLSTAT_MEM_TYPE_MASK)
                    | FLCTL_A_RDBRST_CTLSTAT_MEM_TYPE_0;
            otpOffset = 0;
        }

        /* Clearing any lingering fault flags  and preparing burst verify*/
        BITBAND_PERI(FLCTL_A->RDBRST_CTLSTAT,
                FLCTL_A_RDBRST_CTLSTAT_CLR_STAT_OFS) = 1;
        FLCTL_A->RDBRST_FAILCNT = 0;
        FLCTL_A->RDBRST_STARTADDR = addr - otpOffset;
        FLCTL_A->RDBRST_LEN = (length & 0xFFFFFFF0);
        addr += FLCTL_A->RDBRST_LEN;
        length = length & 0xF;

        /* Starting Burst Verify */
        FLCTL_A->RDBRST_CTLSTAT = (FLCTL_A_RDBRST_CTLSTAT_STOP_FAIL | pattern
                | memoryType | FLCTL_A_RDBRST_CTLSTAT_START);

        /* While the burst read hasn't finished */
        while ((FLCTL_A->RDBRST_CTLSTAT & FLCTL_A_RDBRST_CTLSTAT_BRST_STAT_MASK)
                != FLCTL_A_RDBRST_CTLSTAT_BRST_STAT_3)
        {
            __no_operation();
        }

        /* Checking  for a verification/access error/failure */
        if (BITBAND_PERI(FLCTL_A->RDBRST_CTLSTAT,
                FLCTL_A_RDBRST_CTLSTAT_CMP_ERR_OFS)
                || BITBAND_PERI(FLCTL_A->RDBRST_CTLSTAT,
                        FLCTL_A_RDBRST_CTLSTAT_ADDR_ERR_OFS)
                || FLCTL_A->RDBRST_FAILCNT)
        {
            goto FlashVerifyCleanup;
        }
    }

    /* Remaining Words */
    while (length > 3)
    {
        if (HWREG32(addr) != memoryPattern)
            goto FlashVerifyCleanup;

        addr = addr + 4;
        length = length - 4;
    }

    /* Remaining Bytes */
    while (length > 0)
    {
        if (HWREG8(addr++) != ((uint8_t) memoryPattern))
            goto FlashVerifyCleanup;
        length--;
    }

    /* If we got this far, that means it no failure happened */
    res = true;

    FlashVerifyCleanup:

    /* Clearing the Read Burst flag and returning */
    BITBAND_PERI(FLCTL_A->RDBRST_CTLSTAT, FLCTL_A_RDBRST_CTLSTAT_CLR_STAT_OFS) =
            1;

    FlashCtl_A_setReadMode(startBank, b0readMode);
    FlashCtl_A_setWaitState(startBank, b0WaitState);

    if (startBank != endBank)
    {
        FlashCtl_A_setReadMode(endBank, b1readMode);
        FlashCtl_A_setWaitState(endBank, b1WaitState);
    }

    if (intStatus == 0)
        Interrupt_enableMaster();

    return res;
}


bool FlashCtl_A_performMassErase(void)
{
    uint32_t flashSize, ii, intStatus, jj;
    uint32_t mTries, tlvLength;
    SysCtl_A_FlashTLV_Info *flInfo;
    __FlashCtl_ProtectionRegister protectRegs;
    bool res, needAnotherPulse;

    /* Parsing the TLV and getting the maximum erase pulses */
    SysCtl_A_getTLVInfo(TLV_TAG_FLASHCTL, 0, &tlvLength, (uint32_t**) &flInfo);

    if (tlvLength == 0 || flInfo->maxErasePulses == 0)
    {
        mTries = MAX_ERASE_NO_TLV;
    } else
    {
        mTries = flInfo->maxErasePulses;
    }

    /* Saving interrupt context and disabling interrupts for program
     * operation
     */
    intStatus = CPU_primask();
    Interrupt_disableMaster();

    /* Assume Failure */
    res = false;

    /* Saving off protection settings so we can restore them later */
    __saveProtectionRegisters(&protectRegs);

    for(jj=0;jj<mTries;jj++)
    {
        needAnotherPulse = false;

        /* Clearing old mass erase flags */
        BITBAND_PERI(FLCTL_A->ERASE_CTLSTAT, FLCTL_A_ERASE_CTLSTAT_CLR_STAT_OFS) =
                1;

        /* Performing the mass erase */
        FLCTL_A->ERASE_CTLSTAT |= (FLCTL_A_ERASE_CTLSTAT_MODE
                | FLCTL_A_ERASE_CTLSTAT_START);

        while ((FLCTL_A->ERASE_CTLSTAT & FLCTL_A_ERASE_CTLSTAT_STATUS_MASK)
                == FLCTL_A_ERASE_CTLSTAT_STATUS_1
                || (FLCTL_A->ERASE_CTLSTAT & FLCTL_A_ERASE_CTLSTAT_STATUS_MASK)
                        == FLCTL_A_ERASE_CTLSTAT_STATUS_2)
        {
            __no_operation();
        }

        /* Return false if an address error */
        if (BITBAND_PERI(FLCTL_A->ERASE_CTLSTAT,
                FLCTL_A_ERASE_CTLSTAT_ADDR_ERR_OFS))
            goto MassEraseCleanup;

        /* Verifying the user memory that might have been erased */
        flashSize = SysCtl_A_getFlashSize();

        /* Clearing old flag */
        BITBAND_PERI(FLCTL_A->ERASE_CTLSTAT, FLCTL_A_ERASE_CTLSTAT_CLR_STAT_OFS) =
                1;

        for (ii = 0; ii < flashSize; ii += FLASH_A_SECTOR_SIZE)
        {
            if (!FlashCtl_A_isMemoryProtected(ii))
            {
                if (!FlashCtl_A_verifyMemory((void*) ii, FLASH_A_SECTOR_SIZE,
                FLASH_A_1_PATTERN))
                {
                    needAnotherPulse = true;
                }
                else
                {
                    FlashCtl_A_protectMemory(ii,ii);
                }
            }
        }

        /* Verifying the INFO memory that might be protected */
        flashSize = SysCtl_A_getInfoFlashSize() + __INFO_FLASH_A_TECH_START__;

        for (ii = __INFO_FLASH_A_TECH_START__; ii < flashSize; ii +=
                FLASH_A_SECTOR_SIZE)
        {
            if (!FlashCtl_A_isMemoryProtected(ii))
            {
                if (!FlashCtl_A_verifyMemory((void*) ii, FLASH_A_SECTOR_SIZE,
                FLASH_A_1_PATTERN))
                {
                    needAnotherPulse = true;
                }
                else
                {
                    FlashCtl_A_protectMemory(ii,ii);
                }
            }
        }

