alibaba/AliOS-Things/platform/mcu/msp432p4xx/ti/devices/msp432p4xx/rom/msp432p4111_driverlib.c
    FlashCtl_A_disableWordProgramming();
    return res;

}


void FlashCtl_A_setWaitState(uint32_t flashBank, uint32_t waitState)
{
    if (flashBank == FLASH_A_BANK0)
    {
        FLCTL_A->BANK0_RDCTL = (FLCTL_A->BANK0_RDCTL
                & ~FLCTL_A_BANK0_RDCTL_WAIT_MASK)
                | (waitState << FLCTL_A_BANK0_RDCTL_WAIT_OFS);
    } else if (flashBank == FLASH_A_BANK1)
    {
        FLCTL_A->BANK1_RDCTL = (FLCTL_A->BANK1_RDCTL
                & ~FLCTL_A_BANK1_RDCTL_WAIT_MASK)
                | (waitState << FLCTL_A_BANK1_RDCTL_WAIT_OFS);
    } else
    {
        ASSERT(false);
    }
}


uint32_t FlashCtl_A_getWaitState(uint32_t flashBank)
{
    if (flashBank == FLASH_A_BANK0)
    {
        return (FLCTL_A->BANK0_RDCTL & FLCTL_A_BANK0_RDCTL_WAIT_MASK)
                >> FLCTL_A_BANK0_RDCTL_WAIT_OFS;
    } else if (flashBank == FLASH_A_BANK1)
    {
        return (FLCTL_A->BANK1_RDCTL & FLCTL_A_BANK1_RDCTL_WAIT_MASK)
                >> FLCTL_A_BANK1_RDCTL_WAIT_OFS;
    } else
    {
        ASSERT(false);
        return 0;
    }
}


void FlashCtl_A_setProgramVerification(uint32_t verificationSetting)
{
    if ((verificationSetting & FLASH_A_BURSTPOST))
        BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                FLCTL_A_PRGBRST_CTLSTAT_AUTO_PST_OFS) = 1;

    if ((verificationSetting & FLASH_A_BURSTPRE))
        BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                FLCTL_A_PRGBRST_CTLSTAT_AUTO_PRE_OFS) = 1;

    if ((verificationSetting & FLASH_A_REGPRE))
        BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_VER_PRE_OFS) = 1;

    if ((verificationSetting & FLASH_A_REGPOST))
        BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_VER_PST_OFS) = 1;
}


void FlashCtl_A_clearProgramVerification(uint32_t verificationSetting)
{
    if ((verificationSetting & FLASH_A_BURSTPOST))
        BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                FLCTL_A_PRGBRST_CTLSTAT_AUTO_PST_OFS) = 0;

    if ((verificationSetting & FLASH_A_BURSTPRE))
        BITBAND_PERI(FLCTL_A->PRGBRST_CTLSTAT,
                FLCTL_A_PRGBRST_CTLSTAT_AUTO_PRE_OFS) = 0;

    if ((verificationSetting & FLASH_A_REGPRE))
        BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_VER_PRE_OFS) = 0;

    if ((verificationSetting & FLASH_A_REGPOST))
        BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_VER_PST_OFS) = 0;

}


void FlashCtl_A_enableWordProgramming(uint32_t mode)
{
    if (mode == FLASH_A_IMMEDIATE_WRITE_MODE)
    {
        BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_ENABLE_OFS) = 1;
        BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_MODE_OFS) = 0;

    } else if (mode == FLASH_A_COLLATED_WRITE_MODE)
    {
        BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_ENABLE_OFS) = 1;
        BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_MODE_OFS) = 1;
    }
}


void FlashCtl_A_disableWordProgramming(void)
{
    BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_ENABLE_OFS) = 0;
}


uint32_t FlashCtl_A_getReadMode(uint32_t flashBank)
{
    if (flashBank == FLASH_A_BANK0)
    {
        return (FLCTL_A->BANK0_RDCTL & FLCTL_A_BANK0_RDCTL_RD_MODE_STATUS_MASK)
                    >> 16;
    } else if (flashBank == FLASH_A_BANK1)
    {
        return (FLCTL_A->BANK1_RDCTL & FLCTL_A_BANK1_RDCTL_RD_MODE_STATUS_MASK) 
                    >> 16;
    } else
    {
        ASSERT(false);
        return 0;
    }
}


uint32_t FlashCtl_A_isWordProgrammingEnabled(void)
{
    if (!BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_ENABLE_OFS))
    {
        return 0;
    } else if (BITBAND_PERI(FLCTL_A->PRG_CTLSTAT, FLCTL_A_PRG_CTLSTAT_MODE_OFS))
        return FLASH_A_COLLATED_WRITE_MODE;
    else
        return FLASH_A_IMMEDIATE_WRITE_MODE;
}


void FlashCtl_A_enableInterrupt(uint32_t flags)
{
    FLCTL_A->IE |= flags;
}


void FlashCtl_A_disableInterrupt(uint32_t flags)
{
    FLCTL_A->IE &= ~flags;
}


uint32_t FlashCtl_A_getEnabledInterruptStatus(void)
{
    return FlashCtl_A_getInterruptStatus() & FLCTL_A->IE;
}


void FlashCtl_A_initiateSectorErase(uint32_t addr)
{
    uint_fast8_t memoryType;
    uint32_t otpOffset = 0;

    memoryType = addr >= SysCtl_A_getFlashSize() ?
    FLASH_A_INFO_SPACE :
                                              FLASH_A_MAIN_SPACE;

    /* We can only erase on 4KB boundaries */
    while (addr & 0xFFF)
    {
        addr--;
    }

    /* Clearing the status */
    BITBAND_PERI(FLCTL_A->ERASE_CTLSTAT, FLCTL_A_ERASE_CTLSTAT_CLR_STAT_OFS) =
            1;

    if (memoryType == FLASH_A_INFO_SPACE)
    {
        otpOffset = __INFO_FLASH_A_TECH_START__;
        FLCTL_A->ERASE_CTLSTAT = (FLCTL_A->ERASE_CTLSTAT
                & ~(FLCTL_A_ERASE_CTLSTAT_TYPE_MASK))
                | FLCTL_A_ERASE_CTLSTAT_TYPE_1;

    } else
    {
        otpOffset = 0;
        FLCTL_A->ERASE_CTLSTAT = (FLCTL_A->ERASE_CTLSTAT
                & ~(FLCTL_A_ERASE_CTLSTAT_TYPE_MASK))
                | FLCTL_A_ERASE_CTLSTAT_TYPE_0;
    }

    /* Clearing old flags  and setting up the erase */
    BITBAND_PERI(FLCTL_A->ERASE_CTLSTAT, FLCTL_A_ERASE_CTLSTAT_MODE_OFS) = 0;
    FLCTL_A->ERASE_SECTADDR = addr - otpOffset;

    /* Starting the erase */
    BITBAND_PERI(FLCTL_A->ERASE_CTLSTAT, FLCTL_A_ERASE_CTLSTAT_START_OFS) = 1;

}


void FlashCtl_A_initiateMassErase(void)
{
    /* Clearing old mass erase flags */
    BITBAND_PERI(FLCTL_A->ERASE_CTLSTAT, FLCTL_A_ERASE_CTLSTAT_CLR_STAT_OFS) =
            1;

    /* Performing the mass erase */
    FLCTL_A->ERASE_CTLSTAT |= (FLCTL_A_ERASE_CTLSTAT_MODE
            | FLCTL_A_ERASE_CTLSTAT_START);
}


uint32_t FlashCtl_A_getInterruptStatus(void)
{
    return FLCTL_A->IFG;
}


bool FlashCtl_A_setReadMode(uint32_t flashBank, uint32_t readMode)
{

    if (FLCTL_A->POWER_STAT & FLCTL_A_POWER_STAT_RD_2T)
        return false;

    if (flashBank == FLASH_A_BANK0)
    {
        FLCTL_A->BANK0_RDCTL = (FLCTL_A->BANK0_RDCTL
                & ~FLCTL_A_BANK0_RDCTL_RD_MODE_MASK) | readMode;
        while ((FLCTL_A->BANK0_RDCTL & FLCTL_A_BANK0_RDCTL_RD_MODE_STATUS_MASK)
                != (readMode<<16))
            ;
    } else if (flashBank == FLASH_A_BANK1)
    {
        FLCTL_A->BANK1_RDCTL = (FLCTL_A->BANK1_RDCTL
                & ~FLCTL_A_BANK1_RDCTL_RD_MODE_MASK) | readMode;
        while ((FLCTL_A->BANK1_RDCTL & FLCTL_A_BANK1_RDCTL_RD_MODE_STATUS_MASK)
                != (readMode<<16))
            ;
    } else
    {
        ASSERT(false);
        return false;
    }

