alibaba/AliOS-Things/platform/mcu/msp432p4xx/ti/devices/msp432p4xx/rom/msp432p4111_driverlib.c
    if (bankBit < 32)
    {
        SYSCTL_A->SRAM_BANKEN_CTL0 |= (1 << bankBit);
    } else if (bankBit < 64)
    {
        SYSCTL_A->SRAM_BANKEN_CTL1 |= (1 << (bankBit - 32));
    } else if (bankBit < 96)
    {
        SYSCTL_A->SRAM_BANKEN_CTL2 |= (1 << (bankBit - 64));
    } else
    {
        SYSCTL_A->SRAM_BANKEN_CTL3 |= (1 << (bankBit - 96));
    }


    return true;
}


bool SysCtl_A_disableSRAM(uint32_t addr)
{
    uint32_t bankSize, bankBit;

    /* If SRAM is busy, return false */
    if(!(SYSCTL_A->SRAM_STAT & SYSCTL_A_SRAM_STAT_BNKEN_RDY))
        return false;

    /* Grabbing the bank size */
    bankSize = SysCtl_A_getSRAMSize() / SYSCTL_A->SRAM_NUMBANKS;
    bankBit = (addr - SRAM_BASE) / bankSize;

    if (bankBit < 32)
    {
        SYSCTL_A->SRAM_BANKEN_CTL0 &= ~(0xFFFFFFFF << bankBit);
    } else if (bankBit < 64)
    {
        SYSCTL_A->SRAM_BANKEN_CTL1 &= ~(0xFFFFFFFF << (bankBit - 32));
    } else if (bankBit < 96)
    {
        SYSCTL_A->SRAM_BANKEN_CTL2 &= ~(0xFFFFFFFF << (bankBit - 64));
    } else
    {
        SYSCTL_A->SRAM_BANKEN_CTL3 &= ~(0xFFFFFFFF << (bankBit - 96));
    }


    return true;
}


uint_least32_t SysCtl_A_getInfoFlashSize(void)
{
    return SYSCTL_A->INFOFLASH_SIZE;
}


bool SysCtl_A_enableSRAMRetention(uint32_t startAddr,
        uint32_t endAddr)
{
    uint32_t blockSize, blockBitStart, blockBitEnd;

    if (startAddr > endAddr)
        return false;

    /* If SRAM is busy, return false */
    if(!(SYSCTL_A->SRAM_STAT & SYSCTL_A_SRAM_STAT_BLKRET_RDY))
        return false;

    /* Getting how big each bank is and how many blocks we have per bank */
    blockSize = SysCtl_A_getSRAMSize() / SYSCTL_A->SRAM_NUMBLOCKS;
    blockBitStart = (startAddr - SRAM_BASE) / blockSize;
    blockBitEnd = (endAddr - SRAM_BASE) / blockSize;

    if (blockBitStart < 32)
    {
        if (blockBitEnd < 32)
        {
            SYSCTL_A->SRAM_BLKRET_CTL0 |= (0xFFFFFFFF >> (31 - blockBitEnd))
                    & (0xFFFFFFFF << blockBitStart);
            return true;
        } else if (blockBitEnd < 64)
        {
            SYSCTL_A->SRAM_BLKRET_CTL0 |= (0xFFFFFFFF << blockBitStart);
            SYSCTL_A->SRAM_BLKRET_CTL1 |= (0xFFFFFFFF
                    >> (31 - (blockBitEnd - 32)));
        } else if (blockBitEnd < 96)
        {
            SYSCTL_A->SRAM_BLKRET_CTL0 |= (0xFFFFFFFF << blockBitStart);
            SYSCTL_A->SRAM_BLKRET_CTL1 = 0xFFFFFFFF;
            SYSCTL_A->SRAM_BLKRET_CTL2 |= (0xFFFFFFFF
                    >> (31 - (blockBitEnd - 64)));
        } else
        {
            SYSCTL_A->SRAM_BLKRET_CTL0 |= (0xFFFFFFFF << blockBitStart);
            SYSCTL_A->SRAM_BLKRET_CTL1 = 0xFFFFFFFF;
            SYSCTL_A->SRAM_BLKRET_CTL2 = 0xFFFFFFFF;
            SYSCTL_A->SRAM_BLKRET_CTL3 |= (0xFFFFFFFF
                    >> (31 - (blockBitEnd - 96)));
        }
    } else if (blockBitStart < 64)
    {
        if (blockBitEnd < 64)
        {
            SYSCTL_A->SRAM_BLKRET_CTL1 |= ((0xFFFFFFFF
                    >> (31 - (blockBitEnd - 32)))
                    & (0xFFFFFFFF << (blockBitStart - 32)));
            return true;
        }

        SYSCTL_A->SRAM_BLKRET_CTL1 = (0xFFFFFFFF << (blockBitStart - 32));

        if (blockBitEnd < 96)
        {
            SYSCTL_A->SRAM_BLKRET_CTL2 |= (0xFFFFFFFF
                    >> (31 - (blockBitEnd - 64)));
        } else
        {

            SYSCTL_A->SRAM_BLKRET_CTL2 |= 0xFFFFFFFF;
            SYSCTL_A->SRAM_BLKRET_CTL3 |= (0xFFFFFFFF
                    >> (31 - (blockBitEnd - 96)));
        }
    } else if (blockBitStart < 96)
    {
        if (blockBitEnd < 96)
        {
            SYSCTL_A->SRAM_BLKRET_CTL2 |= (0xFFFFFFFF
                    >> (31 - (blockBitEnd - 64)))
                    & (0xFFFFFFFF << (blockBitStart - 64));
            return true;
        } else
        {
            SYSCTL_A->SRAM_BLKRET_CTL2 |= (0xFFFFFFFF << (blockBitStart - 64));
            SYSCTL_A->SRAM_BLKRET_CTL3 |= (0xFFFFFFFF
                    >> (31 - (blockBitEnd - 96)));
        }
    } else
    {
        SYSCTL_A->SRAM_BLKRET_CTL3 |= (0xFFFFFFFF >> (31 - (blockBitEnd - 96)))
                & (0xFFFFFFFF << (blockBitStart - 96));
    }

    return true;

}


bool SysCtl_A_disableSRAMRetention(uint32_t startAddr,
        uint32_t endAddr)
{
    uint32_t blockSize, blockBitStart, blockBitEnd;

    if (startAddr > endAddr)
        return false;

    /* If SRAM is busy, return false */
    if(!(SYSCTL_A->SRAM_STAT & SYSCTL_A_SRAM_STAT_BLKRET_RDY))
        return false;


    /* Getting how big each bank is and how many blocks we have per bank */
    blockSize = SysCtl_A_getSRAMSize() / SYSCTL_A->SRAM_NUMBLOCKS;
    blockBitStart = (startAddr - SRAM_BASE) / blockSize;
    blockBitEnd = (endAddr - SRAM_BASE) / blockSize;

    if (blockBitStart < 32)
    {
        if (blockBitEnd < 32)
        {
            SYSCTL_A->SRAM_BLKRET_CTL0 &= ~((0xFFFFFFFF >> (31 - blockBitEnd))
                    & (0xFFFFFFFF << blockBitStart));
            return true;
        }

        SYSCTL_A->SRAM_BLKRET_CTL0 &= ~((0xFFFFFFFF << blockBitStart));

        if (blockBitEnd < 64)
        {
            SYSCTL_A->SRAM_BLKRET_CTL1 &= ~((0xFFFFFFFF
                    >> (31 - (blockBitEnd - 32))));
        } else if (blockBitEnd < 96)
        {
            SYSCTL_A->SRAM_BLKRET_CTL1 = 0;
            SYSCTL_A->SRAM_BLKRET_CTL2 &= ~(0xFFFFFFFF
                    >> (31 - (blockBitEnd - 64)));
        } else
        {
            SYSCTL_A->SRAM_BLKRET_CTL1 = 0;
            SYSCTL_A->SRAM_BLKRET_CTL2 = 0;
            SYSCTL_A->SRAM_BLKRET_CTL3 &= ~(0xFFFFFFFF
                    >> (31 - (blockBitEnd - 96)));
        }
    } else if (blockBitStart < 64)
    {
        if (blockBitEnd < 64)
        {
            SYSCTL_A->SRAM_BLKRET_CTL1 &= ~((0xFFFFFFFF
                    >> (31 - (blockBitEnd - 32)))
                    & (0xFFFFFFFF << (blockBitStart - 32)));
            return true;
        }

        SYSCTL_A->SRAM_BLKRET_CTL1 &= ~(0xFFFFFFFF << (blockBitStart - 32));

        if (blockBitEnd < 96)
        {
            SYSCTL_A->SRAM_BLKRET_CTL2 &= ~(0xFFFFFFFF
                    >> (31 - (blockBitEnd - 64)));
        } else
        {

            SYSCTL_A->SRAM_BLKRET_CTL2 = 0;
            SYSCTL_A->SRAM_BLKRET_CTL3 &= ~(0xFFFFFFFF
                    >> (31 - (blockBitEnd - 96)));
        }
    } else if (blockBitStart < 96)
    {
        if (blockBitEnd < 96)
        {
            SYSCTL_A->SRAM_BLKRET_CTL2 &= ~((0xFFFFFFFF
                    >> (31 - (blockBitEnd - 64)))
                    & (0xFFFFFFFF << (blockBitStart - 64)));
        } else
        {
            SYSCTL_A->SRAM_BLKRET_CTL2 &= ~(0xFFFFFFFF << (blockBitStart - 64));
            SYSCTL_A->SRAM_BLKRET_CTL3 &= ~(0xFFFFFFFF
                    >> (31 - (blockBitEnd - 96)));
        }
    } else
    {
        SYSCTL_A->SRAM_BLKRET_CTL3 &= ~((0xFFFFFFFF >> (31 - (blockBitEnd - 96)))
                & (0xFFFFFFFF << (blockBitStart - 96)));
    }

