alibaba/AliOS-Things/platform/mcu/msp432p4xx/ti/devices/msp432p4xx/rom/msp432p4111_driverlib.c
void LCD_F_setAnimationControl(uint_fast16_t clockPrescalar,
        uint_fast16_t divider, uint_fast16_t frames)
{
    LCD_F->ANMCTL = (LCD_F->ANMCTL
            & ~(LCD_F_ANMCTL_ANMPRE_MASK | LCD_F_ANMCTL_ANMDIV_MASK
                    | LCD_F_ANMCTL_ANMSTP_MASK)) | clockPrescalar | divider
            | frames;
}


void LCD_F_clearAllAnimationMemory(void)
{
    BITBAND_PERI(LCD_F->ANMCTL, LCD_F_ANMCTL_ANMCLR_OFS) = 1;
}


void LCD_F_setPinAsLCDFunction(uint_fast8_t pin)
{
    uint32_t val = (pin & 0x1F);

    BITBAND_PERI(LCD_F->CTL, LCD_F_CTL_ON_OFS) = 0;

    if((pin >> 5) == 0)
    {
        BITBAND_PERI(LCD_F->PCTL0, val) = 1;
    }
    else
    {
        BITBAND_PERI(LCD_F->PCTL1, val) = 1;
    }
}


void LCD_F_setPinAsPortFunction(uint_fast8_t pin)
{
    uint32_t val = (pin & 0x1F);

    BITBAND_PERI(LCD_F->CTL, LCD_F_CTL_ON_OFS) = 0;

    if((pin >> 5) == 0)
    {
        BITBAND_PERI(LCD_F->PCTL0, val) = 0;
    }
    else
    {
        BITBAND_PERI(LCD_F->PCTL1, val) = 0;
    }
}


void LCD_F_setPinsAsLCDFunction(uint_fast8_t startPin, uint8_t endPin)
{
    uint32_t startIdx = startPin >> 5;
    uint32_t endIdx = endPin >> 5;
    uint32_t startPos = startPin & 0x1F;
    uint32_t endPos = endPin & 0x1F;

    BITBAND_PERI(LCD_F->CTL, LCD_F_CTL_ON_OFS) = 0;

    if (startIdx == endIdx)
    {
        if (startIdx == 0)
        {
            LCD_F->PCTL0 = (0xFFFFFFFF >> (31 - endPos))
                    & (0xFFFFFFFF << startPos);
        } else
        {
            LCD_F->PCTL1 = (0xFFFFFFFF >> (31 - endPos))
                    & (0xFFFFFFFF << startPos);
        }
    } else
    {
        LCD_F->PCTL0 = (0xFFFFFFFF << startPos);
        LCD_F->PCTL1 = (0xFFFFFFFF >> (31 - endPos));
    }
}


void LCD_F_setPinAsCOM(uint8_t pin, uint_fast8_t com)
{
    uint32_t val = (pin & 0x1F);
    uint8_t muxRate = LCD_F->CTL | LCD_F_CTL_MX_MASK;

    BITBAND_PERI(LCD_F->CTL, LCD_F_CTL_ON_OFS) = 0;

    if((pin >> 5) == 0)
    {
        BITBAND_PERI(LCD_F->CSSEL0, val) = 1;
    }
    else
    {
        BITBAND_PERI(LCD_F->CSSEL1, val) = 1;
    }

    /* Set LCDMem to COM as well for corresponding pins */
    if(muxRate <= LCD_F_CTL_MX_3)
    {
        if(pin & 1)
        {
            HWREG8(LCD_F_BASE + OFS_LCDM0W + pin / 2) |= (com & 0xF) << 4;
            HWREG8(LCD_F_BASE + OFS_LCDBM0W + pin / 2) |= (com & 0xF) << 4;
        }
        else
        {
            HWREG8(LCD_F_BASE + OFS_LCDM0W + pin / 2) |= (com & 0xF);
            HWREG8(LCD_F_BASE + OFS_LCDBM0W + pin / 2) |= (com & 0xF);
        }
    }
    else
    {
        //5-mux, 6-mux, 7-mux, 8-mux
        HWREG8(LCD_F_BASE + OFS_LCDM0W + pin) |= com;
        HWREG8(LCD_F_BASE + OFS_LCDBM0W + pin) |= com;
    }
}


void LCD_F_setPinAsSEG(uint_fast8_t pin)
{
    uint32_t val = (pin & 0x1F);
    uint8_t muxRate = LCD_F->CTL | LCD_F_CTL_MX_MASK;

    BITBAND_PERI(LCD_F->CTL, LCD_F_CTL_ON_OFS) = 0;

    if((pin >> 5) == 0)
    {
        BITBAND_PERI(LCD_F->CSSEL0, val) = 0;
    }
    else
    {
        BITBAND_PERI(LCD_F->CSSEL1, val) = 0;
    }
}


void LCD_F_selectBias(uint_fast16_t bias)
{
    BITBAND_PERI(LCD_F->CTL, LCD_F_CTL_ON_OFS) = 0;
    LCD_F->VCPCTL = (LCD_F->VCPCTL & ~LCD_F_VCPCTL_LCD2B) | bias;
}


void LCD_F_setVLCDSource(uint_fast16_t v2v3v4Source, uint_fast16_t v5Source)
{
    BITBAND_PERI(LCD_F->CTL, LCD_F_CTL_ON_OFS) = 0;
    LCD_F->VCPCTL = (LCD_F->VCPCTL
            & ~(LCD_F_VCPCTL_REXT | LCD_F_VCPCTL_EXTBIAS
                    | LCD_F_VCPCTL_R03EXT)) | v2v3v4Source | v5Source;
}


void LCD_F_clearInterrupt(uint32_t mask)
{
    LCD_F->CLRIFG |= mask;
}


uint32_t LCD_F_getInterruptStatus(void)
{
    return LCD_F->IFG;
}


uint32_t LCD_F_getEnabledInterruptStatus(void)
{
    return (LCD_F->IFG & LCD_F->IE);
}


void LCD_F_enableInterrupt(uint32_t mask)
{
    LCD_F->IE |= mask;
}


void LCD_F_disableInterrupt(uint32_t mask)
{
    LCD_F->IE &= ~mask;
}


